const goods = document.querySelector('.goods'); // select
const square = document.querySelector('.square'); // площадь
const layer = document.querySelector('.layer'); // толщина слоя
const out1 = document.querySelector('.out-1'); // Расход
const out1 = document.querySelector('.out-1'); // Количество мешков
const out1 = document.querySelector('.out-1'); // Цена
const goodsImg = document.querySelector('.goods-img'); // 

// Замена изображения при выборе товара в select -- 15-59

















// *******************************
// Task 01
// Создайте верстку в HTML, указанную в видеоуроке.

// Task 01
// Создайте в JavaScript константы goods, square, layer, out1, out2, out3, goodsImg как показано в уроке.

// Task 02
// Напишите функцию t02, которая получает из select value текущего товара и заменяет изображение на изображение выбранного товара.

// Task 03
// Добавьте в код JS, запуск функции t02 по событию change элемента goods.

// Task 04
// Создайте функцию t01. Создайте в ней переменные expenditure, k, price. Все три переменные равны нулю.

// Task 05
// Напишите switch case для первых двух товаров, как указано в видео.

// Task 06
// Добавьте в код расчет расхода по формуле:

// expenditure = square.value * layer.value * k
// Task 07
// Выведите результат расчета расхода в кг на страницу в элемент .out-1.

// Task 08
// Вернитесь в функцию t02, и после кода отвечающего за смену изображения, добавьте очистку элементов .out-1, .out-2, .out-3 как показано на видео.

// Task 9
// Вернитесь в функцию t01. Добавьте вывод на страницу расхода в мешках. Для это поделите переменную expenditure на 25, после чего округлите результат в большую сторону.

// Task 10
// Выведите стоимость товара, умножив количество мешков на их price.

// Task 11
// Добавьте остальные товары в выпадающий список и switch case. Проверьте работоспособность кода.

// Task 12
// Добавьте проверку на отрицательную площадь, вводимую в square.

// Task 13
// Добавьте проверку на отрицательную толщину слоя, вводимую в layer.

// Task 14
// Добавьте проверку на толщину слоя больше 100мм.

// Task 15
// Добавьте проверки на пустую строку вводимую в square и layer. Если значение - пустая строка, то ставьте значение переменных равное 1 и присвойте в input для площади и толщины слоя значение 1.

// Проверка на пустую строку проводится так:

// if (square.value.trim() === '') {
//   square.value = 1;
// }
// аналогично и для толщины слоя.
// ============================================================
// Task 02
// Task 03
// Task 04
// Task 05
// Task 06
// Task 07
// Task 08
// Task 9
// Task 10
// Task 11
// Task 12
// Task 13
// Task 14
// Task 15
